src/test/load-test.yaml
#config:
#  target: https://fl1o3z00s4.execute-api.us-west-2.amazonaws.com
#  phases:
##    - duration: 10
##      arrivalRate: 1
##      rampTo: 5
##      name: "Warm up the API"
##    - duration: 60
##      arrivalRate: 5
##      rampTo: 20
##    - duration: 60
##      arrivalRate: 100
##      name: "Ramp to peak load"
#    - duration: 10
#      arrivalCount: 100  # Send 100 users immediately
##    - duration: 300
##      arrivalRate: 50
##      name: "sustained peak load"
#  plugins:
#    publish-metrics:
#      - type: cloudwatch
#        region: us-west-2
#        namespace: "bursting-testing"
#
#  defaults:
#    headers:
#      Content-Type: "application/json"
#
#
#scenarios:
#  - name: " bedrock endpoint Load test"
#    flow:
#      - post:
#          url: "/Prod/invoke"
#          json:
#            prompt: "What is the capital of France?"
##            max_tokens: 100
##            temperature: 0.7
##            top_p: 0.9
#          capture:
#            - json: "$.completion"  # adapte si ta réponse JSON a une autre structure
#              as: completion_output
#          afterResponse: |
#            function (req, res, context, ee, next) {
#                console.log("Response status:", res.statusCode);
#                console.log("Response body:", res.body);
#                if (res.statusCode >= 400) {
#                  console.error("❌ Error: " + res.statusCode + " - " + res.body);
#                }
#                return next();
#              }
#
#
#

config:
  target: "https://fl1o3z00s4.execute-api.us-west-2.amazonaws.com"
  phases:
    - duration: 1
      arrivalCount: 100

  processor: "./processor.js"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Bedrock Endpoint Load Test"
    flow:
      - post:
          url: "/Prod/invoke"
          json:
            prompt: "What is the capital of France?"
            max_tokens: 100
            temperature: 0.7
            top_p: 0.9
          afterResponse: "logResponse"